Revit 2027 API
MEPSystem.GetSectionByNumber Method
 Get the Section from section number
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPSection GetSectionByNumber(
	int sectionNumber
)
Public Function GetSectionByNumber (
	sectionNumber As Integer
) As MEPSection
public:
MEPSection^ GetSectionByNumber(
	int sectionNumber
)
member GetSectionByNumber :
        sectionNumber : int -> MEPSection
Parameters
sectionNumber Int32
 The Section number.
Return Value
MEPSection
 The section. null if the no section exists for the input section number.
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace